Catalogs/ВариантыХраненияИсторииЗвонковАТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВариантыХраненияИсторииЗвонковАТС</Name>
			<Comment>Для хранения настроек для Asterisk</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтрокаДрайвера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДляПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольДляПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутренниеНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутренниеГруппыНомеров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДоступаКЗаписям</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписиНачальныйКаталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписиХост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписиПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписиЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписиПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписиСтрокаЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписиФорматИерархииПапок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимFTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстыВходящихЗвонков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВариантыХраненияИсторииЗвонковАТС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьЭлементов();	
КонецПроцедуры

&НаСервере
Процедура ТестПодключенияНаСервере()

	СтрокаПодключения = "
		|DRIVER=%1;
		|SERVER=%2;
		|PORT=%3;
		|DATABASE=%4;
		|UID=%5;
		|PWD=%6;";
	
	СтрокаПодключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаПодключения, 
								Объект.СтрокаДрайвера, 
								Объект.Сервер, 
								Формат(Объект.Порт, "ЧГ="),
								Объект.БазаДанных,
								Объект.ЛогинДляПодключения,
								Объект.ПарольДляПодключения);
								
	ВнИсточник = Неопределено;
	Если Объект.Ссылка = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskCDRViewerModMySql Тогда
		ВнИсточник = ВнешниеИсточникиДанных.AsteriskCDRViewerMod;
	ИначеЕсли Объект.Ссылка = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskFreePBX Тогда
		ВнИсточник = ВнешниеИсточникиДанных.AsteriskFreePBX;
	ИначеЕсли Объект.Ссылка = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskFreePBX2 Тогда
		ВнИсточник = ВнешниеИсточникиДанных.AsteriskFreePBX2;
	КонецЕсли;
	Если ВнИсточник = Неопределено Тогда
		Сообщить("Внешний источник не определен");
		Возврат;	
	КонецЕсли;
	
	//ПараметрыСоединенияАстериск = Новый ПараметрыСоединенияВнешнегоИсточникаДанных;
	ПараметрыСоединенияАстериск = ВнИсточник.ПолучитьОбщиеПараметрыСоединения();
	ПараметрыСоединенияАстериск.АутентификацияСтандартная = Истина;
	ПараметрыСоединенияАстериск.ИмяПользователя = Объект.ЛогинДляПодключения;
	ПараметрыСоединенияАстериск.Пароль = Объект.ПарольДляПодключения;
	ПараметрыСоединенияАстериск.СтрокаСоединения = СтрокаПодключения;
	ВнИсточник.УстановитьОбщиеПараметрыСоединения(ПараметрыСоединенияАстериск);
	
	Попытка
		ВнИсточник.УстановитьСоединение();
		ВнИсточник.РазорватьСоединение();
		Сообщить("Успешно");
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ТестПодключения(Команда)
	ТестПодключенияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВариантДоступаКЗаписямПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ГруппаПолучениеЗаписей0.Видимость = Ложь;
	Элементы.ГруппаПолучениеЗаписей1.Видимость = Ложь;
	Элементы.ГруппаПолучениеЗаписей2.Видимость = Ложь;
	Элементы.ГруппаПолучениеЗаписей3.Видимость = Ложь;
	
	Если Объект.ВариантДоступаКЗаписям <= 4 Тогда
		ИмяГруппы = "ГруппаПолучениеЗаписей" + Строка(Объект.ВариантДоступаКЗаписям);
		Элементы[ИмяГруппы].Видимость = Истина;	
	КонецЕсли;
	
	Элементы.ВнутренниеГруппыНомеров.Видимость = (Объект.Ссылка = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskFreePBX);
	Элементы.ВнутренниеНомера.Видимость = (Объект.Ссылка = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskFreePBX);
	
	Элементы.КонтекстыВходящихЗвонков.Видимость = (Объект.Ссылка = Справочники.ВариантыХраненияИсторииЗвонковАТС.AsteriskCDRViewerModMySql);
		
КонецПроцедуры
